[
  {
    "title": "https://www.who.int/news-room",
    "url": "https://www.who.int/news-room",
    "text": "Amended International Health Regulations enter into force WHO publishes full guideline report to help countries ensure safe, equitable access to controlled medicines WHO urges cost effective solutions on NCDs and mental health amidst slowing progress \"Patient safety from the start!\" — WHO urges global investment in safe paediatric and newborn care Latest press conferences Official video, audio, and transcripts in English. Live press conferences Live recordings with translations in all of WHO's six official languages. Improving quality of medicines for maternal health: what can parliamentarians do? WHO Director-General's opening remarks at the media briefing – 18 September 2025  From isolation to inclusion:  community-based mental health care WHO Consultation on the Composition of Influenza Virus Vaccines for Use in the 2026 Southern Hemisphere Influenza Season Photo exhibition | silent killers: uncovering the invisible threats of noncommunicable diseases"
  },
  {
    "title": "https://www.thehindu.com/",
    "url": "https://www.thehindu.com/",
    "text": "September 20, 2025e-Paper The View From IndiaLooking at World Affairs from the Indian perspective. First Day First ShowNews and reviews from the world of cinema and streaming. Today's CacheYour download of the top 5 technology stories of the day. Science For AllThe weekly newsletter from science writers takes the jargon out of science and puts the fun in! Data PointDecoding the headlines with facts, figures, and numbers Health MattersRamya Kannan writes to you on getting to good health, and staying there The Hindu On BooksBooks of the week, reviews, excerpts, new titles and features. September 20, 2025e-Paper Copyright© 2025, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved. BACK TO TOP Terms & conditions|Institutional Subscriber"
  },
  {
    "title": "https://www.altnews.in/",
    "url": "https://www.altnews.in/",
    "text": "Donate Now"
  }
]